Revit 2027 API
FabricationConfiguration.GetMaterialAbbreviation Method
 Gets the abreviation of the material or the insulation or the double wall material.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetMaterialAbbreviation(
	int materialId
)
Public Function GetMaterialAbbreviation (
	materialId As Integer
) As String
public:
String^ GetMaterialAbbreviation(
	int materialId
)
member GetMaterialAbbreviation :
        materialId : int -> string
Parameters
materialId Int32
 The material identifier.
Return Value
String
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace